app/views/containers/show.html.erb

SELECT "measures".* FROM "measures" WHERE "measures"."container_id" = ?  [["container_id", 1]]
---
  <ul>
    <% @container.measures.each do |measure| %>