app/controllers/containers_controller.rb

  def index
    @containers = Container.all
---
SELECT "containers".* FROM "containers"

  def create

    @container = Container.new(container_params)

    @container.volume = Math::PI * @container.radius * @container.radius * @container.height

    respond_to do |format|
      if @container.save
---
INSERT INTO "containers" ("name", "radius", "height", "volume", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @container.destroy
---
DELETE FROM "containers" WHERE "containers"."id" = ?  [["id", 1]]

    def set_container
      @container = Container.find(params[:id])
---
SELECT  "containers".* FROM "containers" WHERE "containers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]