app/controllers/measures_controller.rb

SELECT "measures".* FROM "measures"
---
  def index
    @measures = Measure.all

INSERT INTO "measures" ("container_id", "height", "water_quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create

    @measure = Measure.new(measure_params)
    @measure.container = @container
    volume = Math::PI * @measure.container.radius * @measure.container.radius * (@measure.height/100)
    volume *= 1000
    @measure.water_quantity = volume.round(2)

    respond_to do |format|
      if @measure.save

DELETE FROM "measures" WHERE "measures"."id" = ?  [["id", 1]]
---
  def destroy
    @measure.destroy

SELECT  "containers".* FROM "containers" WHERE "containers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_container
      @container=Container.find(params[:container_id])

SELECT  "measures".* FROM "measures" WHERE "measures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_measure
      @measure = Measure.find(params[:id])